{"courseUrl":"http://coursepress.lnu.se/kurs/moderna-applikationsmiljoer/","name":"\r\n                    Moderna applikationsmiljöer","courseCode":"2DV400","syllabusUrl":"http://prod.kursinfo.lnu.se/utbildning/GenerateDocument.ashx?templatetype=coursesyllabus&code=2DV400&documenttype=pdf&lang=sv","introText":"Kursen Moderna applikationsmiljöer syftar till att undersöka och presentera funktionaliteten hos en modern applikationsmiljö. Som avslutning i kursen hålls en föreläsning om varje applikationsområde som det har arbetats med i kursen.Här kommer du hitta en lista med länkar till inspelningar av presentationerna och även länkar till eventuellt material som finns online och visats under presentationen.WebGL och Three.js, Andreas Ahlborg Länk till inspelning Länk till materialSVG, Oskar Eriksson, Länk till inspelningTemautveckling i WordPress, Oscar Lillheden och Klas Lundin, Länk till inspelningTDD vid plugin utveckling (Test driven developement)– WordPress, Peter Persson, Länk till inspelningDerby.JS och bakomliggande tekniker, Gunnar Annerstedt och Caroline Millgårdh, Länk till inspelning Länk till materialMeteor.js – Realtidsramverket, Hans Bentlöv och Claes Tillborg, Länk till inspelning  bloggen.meteor.com, chatten.meteor.com, bookings.meteor.comjQuery Mobile, Jacob Ottosson, Länk till inspelning Länk till materialMarmalade Cross Platform C++ SDK, Albin Göransson och Alexander Persson, Länk till inspelningAngular.js och Single Page Applikationer, Tryggve Blom och Johan Sjölin, Länk till inspelning Länk till materialTwitter bootstrap och CSS foundation, responsive design, Linus Persson och Max Torstensson, Länk till inspelningSå här ser nu presentationsschemat ut.Lokal Ny227eller connect: connect.sunet.se/kurs_2dv400_lnu_se/Sal Ny227 är nu bokad för presentationer. Jag har bokat upp 50% fler tider än det är projekt så ska inte vara några problem att hitta en tid som passar för alla förhoppningsvis.Länk till timeedit schematBokning av redovisningtid sker i det här spreadsheet dokumentet. Fyll i projektets titel och namnen som ingår i gruppen.Nu tror jag att alla står med på projektlistan. Det gäller att vi kommer igång att hålla möten. Ni som befinner er på distans och gärna övriga också, lägg till mig på skype (kappsegla) så att vi kan kontakta varandra där. Behöver få koll på vilka som föredrar möten på distans så att Martin Fredriksson, (skype: lnu.2dv400.fredriksson) kan ta hand om er i första hand. Ni som vill ha möten på campus, maila eller kontakta mig på annat sätt med förslag på tid som passar er.Jag är upptagen tisdag em och fredag fm. I övrigt är mitt schema ganska fritt än så länge.","lastEntry":{"title":"Inspelade presentationer","writer":"Martin Blomberg","date":"2012-11-13 11:11"}}agnusson, Patrik Freden (Distans)\n13.30 Philip Lin, Ayob Kibert (Distans)\n14.00 MC Donalds, Charlotta Bentzen (Distans)\n14.20 Pontus Björlinder (Distans)\n\n","lastEntry":{"title":"Redovisningstider","writer":"Johan Malmquist","date":"2014-03-25 10:59"}}ll be able to use the program Prospect from home to take and analyze data. We will explore this thing, and our experiences will decide on whether we will buy this instrument. I synchronized this site with Ladok, but not all students seem to be enrolled.","lastEntry":{"title":"","writer":"","date":null}} Emilsson, Christian Nilsson, Filip Johansson, Oskar Georgsson\nTid: 14:00-14:20En filhanterare med versionshantering och förhandsgranskning. Uppdragsgivare är Sigma IT & Managment och slutanvändare är Kristianstad kommun.Jens Aronsson, Joel Stahre, Matthis Stenius,Robin Bertram\nTid: 14:20-14:40\nFortnox är ett företag som erbjuder bokföringstjänster online till företag. Vi har byggt en interaktiv utbildningsplattform som gör det möjligt för Fortnoxs kunder att lära sig deras system. Systemet vi har byggt är ett proof of concept.Peter Magnusson, Stavros Gemitzoglov, Rickard Karlsson, Markus Axelsson, Axel Hernborg, Joakim Jonsson\nTid: 14:40-15:00Vi har utvecklat en applikation för att låta en patient och en handledare “co-browsa” en webbplats tillsammans och kunna markera texter, “highlighta” med mera.Merkur Hoxa, Jimmy Börjesson, Alexander Hall\nTid: 15:00-15:20Projektet där vi gick ifrån nybörjarnivå på Ruby on Rails till att skapa en egen Rails Engine som dynamiskt kan observera modeller i en värdapplikation.Det börjar bli dags för redovisning av era projekt. Jag skulle vilja att de grupper som ska redovisa projektet mailar en titel (t.ex. projektnamet) med 2-3 meningars beskrivning av projektet och ev tidsönskemål till mig senast 20/3 13:00. Vi har redovisning bokad 25/3 13:15-17, Ny 227.Kolla instruktionerna för redovisning och förbered er väl.","lastEntry":{"title":"Examination","writer":"Tobias Ohlsson","date":"2014-04-17 04:13"}}rov för denna kursomgång ges därefter söndag 8/6: kl. 18.00-24.00 eller måndag 9/6: kl. 06.00-12.00 alternativt  18.00-24.00.Jag önskar alla lycka till med slutspurten!","lastEntry":{"title":"Dags för kursvärdering!","writer":"Anne Norling","date":"2014-06-11 09:35"}}